Revit 2027 API
CutMarkType.CutLineExtension Property
 The extension distance to the boundary.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double CutLineExtension { get; set; }
Public Property CutLineExtension As Double
	Get
	Set
public:
property double CutLineExtension {
	double get ();
	void set (double value);
}
member CutLineExtension : float with get, set
Property Value
Double
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: The given value for extensionDistanceToBoundary must be between 0 and 30000 feet.
See Also
Reference
CutMarkType Class
Autodesk.Revit.DB.Architecture Namespace